Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17176.h
// Register: PWM1GIE
#define PWM1GIE PWM1GIE
extern volatile unsigned char           PWM1GIE             __at(0x494);
#ifndef _LIB_BUILD
asm("PWM1GIE equ 0494h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IE                 :1;
        unsigned S1P2IE                 :1;
    };
} PWM1GIEbits_t;
extern volatile PWM1GIEbits_t PWM1GIEbits __at(0x494);
// bitfield macros
#define _PWM1GIE_S1P1_POSN                                  0x0
#define _PWM1GIE_S1P1_POSITION                              0x0
#define _PWM1GIE_S1P1_SIZE                                  0x1
#define _PWM1GIE_S1P1_LENGTH                                0x1
#define _PWM1GIE_S1P1_MASK                                  0x1
#define _PWM1GIE_S1P2_POSN                                  0x1
#define _PWM1GIE_S1P2_POSITION                              0x1
#define _PWM1GIE_S1P2_SIZE                                  0x1
#define _PWM1GIE_S1P2_LENGTH                                0x1
#define _PWM1GIE_S1P2_MASK                                  0x2
#define _PWM1GIE_S1P1IE_POSN                                0x0
#define _PWM1GIE_S1P1IE_POSITION                            0x0
#define _PWM1GIE_S1P1IE_SIZE                                0x1
#define _PWM1GIE_S1P1IE_LENGTH                              0x1
#define _PWM1GIE_S1P1IE_MASK                                0x1
#define _PWM1GIE_S1P2IE_POSN                                0x1
#define _PWM1GIE_S1P2IE_POSITION                            0x1
#define _PWM1GIE_S1P2IE_SIZE                                0x1
#define _PWM1GIE_S1P2IE_LENGTH                              0x1
#define _PWM1GIE_S1P2IE_MASK                                0x2

// Register: PWM1CON
#define PWM1CON PWM1CON
extern volatile unsigned char           PWM1CON             __at(0x495);
#ifndef _LIB_BUILD
asm("PWM1CON equ 0495h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERSNOW                 :1;
        unsigned ERSPOL                 :1;
        unsigned LD                     :1;
        unsigned                        :4;
        unsigned EN                     :1;
    };
} PWM1CONbits_t;
extern volatile PWM1CONbits_t PWM1CONbits __at(0x495);
// bitfield macros
#define _PWM1CON_ERSNOW_POSN                                0x0
#define _PWM1CON_ERSNOW_POSITION                            0x0
#define _PWM1CON_ERSNOW_SIZE                                0x1
#define _PWM1CON_ERSNOW_LENGTH                              0x1
#define _PWM1CON_ERSNOW_MASK                                0x1
#define _PWM1CON_ERSPOL_POSN                                0x1
#define _PWM1CON_ERSPOL_POSITION                            0x1
#define _PWM1CON_ERSPOL_SIZE                                0x1
#define _PWM1CON_ERSPOL_LENGTH                              0x1
#define _PWM1CON_ERSPOL_MASK                                0x2
#define _PWM1CON_LD_POSN                                    0x2
#define _PWM1CON_LD_POSITION                                0x2
#define _PWM1CON_LD_SIZE                                    0x1
#define _PWM1CON_LD_LENGTH                                  0x1
#define _PWM1CON_LD_MASK                                    0x4
#define _PWM1CON_EN_POSN                                    0x7
#define _PWM1CON_EN_POSITION                                0x7
#define _PWM1CON_EN_SIZE                                    0x1
#define _PWM1CON_EN_LENGTH                                  0x1
#define _PWM1CON_EN_MASK                                    0x80

// Register: PWM1S1CFG
#define PWM1S1CFG PWM1S1CFG
extern volatile unsigned char           PWM1S1CFG           __at(0x496);
#ifndef _LIB_BUILD
asm("PWM1S1CFG equ 0496h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned PPEN                   :1;
        unsigned                        :2;
        unsigned POL1                   :1;
        unsigned POL2                   :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
} PWM1S1CFGbits_t;
extern volatile PWM1S1CFGbits_t PWM1S1CFGbits __at(0x496);
// bitfield macros
#define _PWM1S1CFG_MODE_POSN                                0x0
#define _PWM1S1CFG_MODE_POSITION                            0x0
#define _PWM1S1CFG_MODE_SIZE                                0x3
#define _PWM1S1CFG_MODE_LENGTH                              0x3
#define _PWM1S1CFG_MODE_MASK                                0x7
#define _PWM1S1CFG_PPEN_POSN                                0x3
#define _PWM1S1CFG_PPEN_POSITION                            0x3
#define _PWM1S1CFG_PPEN_SIZE                                0x1
#define _PWM1S1CFG_PPEN_LENGTH                              0x1
#define _PWM1S1CFG_PPEN_MASK                                0x8
#define _PWM1S1CFG_POL1_POSN                                0x6
#define _PWM1S1CFG_POL1_POSITION                            0x6
#define _PWM1S1CFG_POL1_SIZE                                0x1
#define _PWM1S1CFG_POL1_LENGTH                              0x1
#define _PWM1S1CFG_POL1_MASK                                0x40
#define _PWM1S1CFG_POL2_POSN                                0x7
#define _PWM1S1CFG_POL2_POSITION                            0x7
#define _PWM1S1CFG_POL2_SIZE                                0x1
#define _PWM1S1CFG_POL2_LENGTH                              0x1
#define _PWM1S1CFG_POL2_MASK                                0x80
#define _PWM1S1CFG_MODE0_POSN                               0x0
#define _PWM1S1CFG_MODE0_POSITION                           0x0
#define _PWM1S1CFG_MODE0_SIZE                               0x1
#define _PWM1S1CFG_MODE0_LENGTH                             0x1
#define _PWM1S1CFG_MODE0_MASK                               0x1
#define _PWM1S1CFG_MODE1_POSN                               0x1
#define _PWM1S1CFG_MODE1_POSITION                           0x1
#define _PWM1S1CFG_MODE1_SIZE                               0x1
#define _PWM1S1CFG_MODE1_LENGTH                             0x1
#define _PWM1S1CFG_MODE1_MASK                               0x2
#define _PWM1S1CFG_MODE2_POSN                               0x2
#define _PWM1S1CFG_MODE2_POSITION                           0x2
#define _PWM1S1CFG_MODE2_SIZE                               0x1
#define _PWM1S1CFG_MODE2_LENGTH                             0x1
#define _PWM1S1CFG_MODE2_MASK                               0x4

// Register: PWM1S1P1
#define PWM1S1P1 PWM1S1P1
extern volatile unsigned short          PWM1S1P1            __at(0x497);
#ifndef _LIB_BUILD
asm("PWM1S1P1 equ 0497h");
#endif

// Register: PWM1S1P1L
#define PWM1S1P1L PWM1S1P1L
extern volatile unsigned char           PWM1S1P1L           __at(0x497);
#ifndef _LIB_BUILD
asm("PWM1S1P1L equ 0497h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
    struct {
        unsigned S1P1L                  :8;
    };
} PWM1S1P1Lbits_t;
