Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17176.h
// Register: OPA1CON2
#define OPA1CON2 OPA1CON2
extern volatile unsigned char           OPA1CON2            __at(0x90E);
#ifndef _LIB_BUILD
asm("OPA1CON2 equ 090Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :3;
        unsigned                        :1;
        unsigned NCH                    :3;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned                        :1;
        unsigned NCH0                   :1;
        unsigned NCH1                   :1;
        unsigned NCH2                   :1;
    };
    struct {
        unsigned OPA1PCH                :3;
        unsigned                        :1;
        unsigned OPA1NCH                :3;
    };
    struct {
        unsigned OPA1PCH0               :1;
        unsigned OPA1PCH1               :1;
        unsigned OPA1PCH2               :1;
        unsigned                        :1;
        unsigned OPA1NCH0               :1;
        unsigned OPA1NCH1               :1;
        unsigned OPA1NCH2               :1;
    };
} OPA1CON2bits_t;
extern volatile OPA1CON2bits_t OPA1CON2bits __at(0x90E);
// bitfield macros
#define _OPA1CON2_PCH_POSN                                  0x0
#define _OPA1CON2_PCH_POSITION                              0x0
#define _OPA1CON2_PCH_SIZE                                  0x3
#define _OPA1CON2_PCH_LENGTH                                0x3
#define _OPA1CON2_PCH_MASK                                  0x7
#define _OPA1CON2_NCH_POSN                                  0x4
#define _OPA1CON2_NCH_POSITION                              0x4
#define _OPA1CON2_NCH_SIZE                                  0x3
#define _OPA1CON2_NCH_LENGTH                                0x3
#define _OPA1CON2_NCH_MASK                                  0x70
#define _OPA1CON2_PCH0_POSN                                 0x0
#define _OPA1CON2_PCH0_POSITION                             0x0
#define _OPA1CON2_PCH0_SIZE                                 0x1
#define _OPA1CON2_PCH0_LENGTH                               0x1
#define _OPA1CON2_PCH0_MASK                                 0x1
#define _OPA1CON2_PCH1_POSN                                 0x1
#define _OPA1CON2_PCH1_POSITION                             0x1
#define _OPA1CON2_PCH1_SIZE                                 0x1
#define _OPA1CON2_PCH1_LENGTH                               0x1
#define _OPA1CON2_PCH1_MASK                                 0x2
#define _OPA1CON2_PCH2_POSN                                 0x2
#define _OPA1CON2_PCH2_POSITION                             0x2
#define _OPA1CON2_PCH2_SIZE                                 0x1
#define _OPA1CON2_PCH2_LENGTH                               0x1
#define _OPA1CON2_PCH2_MASK                                 0x4
#define _OPA1CON2_NCH0_POSN                                 0x4
#define _OPA1CON2_NCH0_POSITION                             0x4
#define _OPA1CON2_NCH0_SIZE                                 0x1
#define _OPA1CON2_NCH0_LENGTH                               0x1
#define _OPA1CON2_NCH0_MASK                                 0x10
#define _OPA1CON2_NCH1_POSN                                 0x5
#define _OPA1CON2_NCH1_POSITION                             0x5
#define _OPA1CON2_NCH1_SIZE                                 0x1
#define _OPA1CON2_NCH1_LENGTH                               0x1
#define _OPA1CON2_NCH1_MASK                                 0x20
#define _OPA1CON2_NCH2_POSN                                 0x6
#define _OPA1CON2_NCH2_POSITION                             0x6
#define _OPA1CON2_NCH2_SIZE                                 0x1
#define _OPA1CON2_NCH2_LENGTH                               0x1
#define _OPA1CON2_NCH2_MASK                                 0x40
#define _OPA1CON2_OPA1PCH_POSN                              0x0
#define _OPA1CON2_OPA1PCH_POSITION                          0x0
#define _OPA1CON2_OPA1PCH_SIZE                              0x3
#define _OPA1CON2_OPA1PCH_LENGTH                            0x3
#define _OPA1CON2_OPA1PCH_MASK                              0x7
#define _OPA1CON2_OPA1NCH_POSN                              0x4
#define _OPA1CON2_OPA1NCH_POSITION                          0x4
#define _OPA1CON2_OPA1NCH_SIZE                              0x3
#define _OPA1CON2_OPA1NCH_LENGTH                            0x3
#define _OPA1CON2_OPA1NCH_MASK                              0x70
#define _OPA1CON2_OPA1PCH0_POSN                             0x0
#define _OPA1CON2_OPA1PCH0_POSITION                         0x0
#define _OPA1CON2_OPA1PCH0_SIZE                             0x1
#define _OPA1CON2_OPA1PCH0_LENGTH                           0x1
#define _OPA1CON2_OPA1PCH0_MASK                             0x1
#define _OPA1CON2_OPA1PCH1_POSN                             0x1
#define _OPA1CON2_OPA1PCH1_POSITION                         0x1
#define _OPA1CON2_OPA1PCH1_SIZE                             0x1
#define _OPA1CON2_OPA1PCH1_LENGTH                           0x1
#define _OPA1CON2_OPA1PCH1_MASK                             0x2
#define _OPA1CON2_OPA1PCH2_POSN                             0x2
#define _OPA1CON2_OPA1PCH2_POSITION                         0x2
#define _OPA1CON2_OPA1PCH2_SIZE                             0x1
#define _OPA1CON2_OPA1PCH2_LENGTH                           0x1
#define _OPA1CON2_OPA1PCH2_MASK                             0x4
#define _OPA1CON2_OPA1NCH0_POSN                             0x4
#define _OPA1CON2_OPA1NCH0_POSITION                         0x4
#define _OPA1CON2_OPA1NCH0_SIZE                             0x1
#define _OPA1CON2_OPA1NCH0_LENGTH                           0x1
#define _OPA1CON2_OPA1NCH0_MASK                             0x10
#define _OPA1CON2_OPA1NCH1_POSN                             0x5
#define _OPA1CON2_OPA1NCH1_POSITION                         0x5
#define _OPA1CON2_OPA1NCH1_SIZE                             0x1
#define _OPA1CON2_OPA1NCH1_LENGTH                           0x1
#define _OPA1CON2_OPA1NCH1_MASK                             0x20
#define _OPA1CON2_OPA1NCH2_POSN                             0x6
#define _OPA1CON2_OPA1NCH2_POSITION                         0x6
#define _OPA1CON2_OPA1NCH2_SIZE                             0x1
#define _OPA1CON2_OPA1NCH2_LENGTH                           0x1
#define _OPA1CON2_OPA1NCH2_MASK                             0x40

// Register: OPA1CON3
#define OPA1CON3 OPA1CON3
extern volatile unsigned char           OPA1CON3            __at(0x90F);
#ifndef _LIB_BUILD
asm("OPA1CON3 equ 090Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSS                    :5;
        unsigned                        :1;
        unsigned FMS                    :2;
    };
    struct {
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned                        :4;
        unsigned FMS0                   :1;
        unsigned FMS1                   :1;
    };
    struct {
        unsigned OPA1PSS                :5;
        unsigned                        :1;
        unsigned OPA1FMS                :2;
    };
    struct {
        unsigned OPA1PSS0               :1;
        unsigned OPA1PSS1               :1;
        unsigned                        :4;
        unsigned OPA1FMS0               :1;
        unsigned OPA1FMS1               :1;
    };
} OPA1CON3bits_t;
extern volatile OPA1CON3bits_t OPA1CON3bits __at(0x90F);
// bitfield macros
#define _OPA1CON3_PSS_POSN                                  0x0
#define _OPA1CON3_PSS_POSITION                              0x0
#define _OPA1CON3_PSS_SIZE                                  0x5
#define _OPA1CON3_PSS_LENGTH                                0x5
#define _OPA1CON3_PSS_MASK                                  0x1F
#define _OPA1CON3_FMS_POSN                                  0x6
#define _OPA1CON3_FMS_POSITION                              0x6
#define _OPA1CON3_FMS_SIZE                                  0x2
#define _OPA1CON3_FMS_LENGTH                                0x2
#define _OPA1CON3_FMS_MASK                                  0xC0
#define _OPA1CON3_PSS0_POSN                                 0x0
#define _OPA1CON3_PSS0_POSITION                             0x0
#define _OPA1CON3_PSS0_SIZE                                 0x1
#define _OPA1CON3_PSS0_LENGTH                               0x1
#define _OPA1CON3_PSS0_MASK                                 0x1
#define _OPA1CON3_PSS1_POSN                                 0x1
#define _OPA1CON3_PSS1_POSITION                             0x1
#define _OPA1CON3_PSS1_SIZE                                 0x1
#define _OPA1CON3_PSS1_LENGTH                               0x1
#define _OPA1CON3_PSS1_MASK                                 0x2
#define _OPA1CON3_FMS0_POSN                                 0x6
#define _OPA1CON3_FMS0_POSITION                             0x6
#define _OPA1CON3_FMS0_SIZE                                 0x1
#define _OPA1CON3_FMS0_LENGTH                               0x1
#define _OPA1CON3_FMS0_MASK                                 0x40
#define _OPA1CON3_FMS1_POSN                                 0x7
#define _OPA1CON3_FMS1_POSITION                             0x7
#define _OPA1CON3_FMS1_SIZE                                 0x1
#define _OPA1CON3_FMS1_LENGTH                               0x1
#define _OPA1CON3_FMS1_MASK                                 0x80
#define _OPA1CON3_OPA1PSS_POSN                              0x0
#define _OPA1CON3_OPA1PSS_POSITION                          0x0
#define _OPA1CON3_OPA1PSS_SIZE                              0x5
#define _OPA1CON3_OPA1PSS_LENGTH                            0x5
#define _OPA1CON3_OPA1PSS_MASK                              0x1F
#define _OPA1CON3_OPA1FMS_POSN                              0x6
#define _OPA1CON3_OPA1FMS_POSITION                          0x6
#define _OPA1CON3_OPA1FMS_SIZE                              0x2
#define _OPA1CON3_OPA1FMS_LENGTH                            0x2
#define _OPA1CON3_OPA1FMS_MASK                              0xC0
#define _OPA1CON3_OPA1PSS0_POSN                             0x0
#define _OPA1CON3_OPA1PSS0_POSITION                         0x0
#define _OPA1CON3_OPA1PSS0_SIZE                             0x1
#define _OPA1CON3_OPA1PSS0_LENGTH                           0x1
#define _OPA1CON3_OPA1PSS0_MASK                             0x1
#define _OPA1CON3_OPA1PSS1_POSN                             0x1
#define _OPA1CON3_OPA1PSS1_POSITION                         0x1
#define _OPA1CON3_OPA1PSS1_SIZE                             0x1
#define _OPA1CON3_OPA1PSS1_LENGTH                           0x1
#define _OPA1CON3_OPA1PSS1_MASK                             0x2
#define _OPA1CON3_OPA1FMS0_POSN                             0x6
#define _OPA1CON3_OPA1FMS0_POSITION                         0x6
#define _OPA1CON3_OPA1FMS0_SIZE                             0x1
#define _OPA1CON3_OPA1FMS0_LENGTH                           0x1
#define _OPA1CON3_OPA1FMS0_MASK                             0x40
#define _OPA1CON3_OPA1FMS1_POSN                             0x7
#define _OPA1CON3_OPA1FMS1_POSITION                         0x7
#define _OPA1CON3_OPA1FMS1_SIZE                             0x1
#define _OPA1CON3_OPA1FMS1_LENGTH                           0x1
#define _OPA1CON3_OPA1FMS1_MASK                             0x80

// Register: OPA1HWC
#define OPA1HWC OPA1HWC
extern volatile unsigned char           OPA1HWC             __at(0x910);
#ifndef _LIB_BUILD
asm("OPA1HWC equ 0910h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HWCL                   :3;
        unsigned ORPOL                  :1;
        unsigned HWCH                   :3;
        unsigned OREN                   :1;
    };
    struct {
        unsigned HWCL0                  :1;
        unsigned HWCL1                  :1;
        unsigned HWCL2                  :1;
        unsigned                        :1;
        unsigned HWCH0                  :1;
        unsigned HWCH1                  :1;
        unsigned HWCH2                  :1;
    };
    struct {
        unsigned OPA1HWCL               :3;
        unsigned OPA1ORPOL              :1;
        unsigned OPA1HWCH               :3;
        unsigned OPA1OREN               :1;
    };
    struct {
        unsigned OPA1HWCL0              :1;
        unsigned OPA1HWCL1              :1;
        unsigned OPA1HWCL2              :1;
        unsigned                        :1;
        unsigned OPA1HWCH0              :1;
        unsigned OPA1HWCH1              :1;
        unsigned OPA1HWCH2              :1;
    };
} OPA1HWCbits_t;
extern volatile OPA1HWCbits_t OPA1HWCbits __at(0x910);
// bitfield macros
#define _OPA1HWC_HWCL_POSN                                  0x0
#define _OPA1HWC_HWCL_POSITION                              0x0
#define _OPA1HWC_HWCL_SIZE                                  0x3
#define _OPA1HWC_HWCL_LENGTH                                0x3
#define _OPA1HWC_HWCL_MASK                                  0x7
#define _OPA1HWC_ORPOL_POSN                                 0x3
#define _OPA1HWC_ORPOL_POSITION                             0x3
#define _OPA1HWC_ORPOL_SIZE                                 0x1
#define _OPA1HWC_ORPOL_LENGTH                               0x1
#define _OPA1HWC_ORPOL_MASK                                 0x8
#define _OPA1HWC_HWCH_POSN                                  0x4
#define _OPA1HWC_HWCH_POSITION                              0x4
#define _OPA1HWC_HWCH_SIZE                                  0x3
#define _OPA1HWC_HWCH_LENGTH                                0x3
#define _OPA1HWC_HWCH_MASK                                  0x70
#define _OPA1HWC_OREN_POSN                                  0x7
#define _OPA1HWC_OREN_POSITION                              0x7
#define _OPA1HWC_OREN_SIZE                                  0x1
#define _OPA1HWC_OREN_LENGTH                                0x1
#define _OPA1HWC_OREN_MASK                                  0x80
#define _OPA1HWC_HWCL0_POSN                                 0x0
#define _OPA1HWC_HWCL0_POSITION                             0x0
#define _OPA1HWC_HWCL0_SIZE                                 0x1
#define _OPA1HWC_HWCL0_LENGTH                               0x1
#define _OPA1HWC_HWCL0_MASK                                 0x1
#define _OPA1HWC_HWCL1_POSN                                 0x1
#define _OPA1HWC_HWCL1_POSITION                             0x1
#define _OPA1HWC_HWCL1_SIZE                                 0x1
#define _OPA1HWC_HWCL1_LENGTH                               0x1
#define _OPA1HWC_HWCL1_MASK                                 0x2
#define _OPA1HWC_HWCL2_POSN                                 0x2
#define _OPA1HWC_HWCL2_POSITION                             0x2
#define _OPA1HWC_HWCL2_SIZE                                 0x1
#define _OPA1HWC_HWCL2_LENGTH                               0x1
#define _OPA1HWC_HWCL2_MASK                                 0x4
#define _OPA1HWC_HWCH0_POSN                                 0x4
#define _OPA1HWC_HWCH0_POSITION                             0x4
#define _OPA1HWC_HWCH0_SIZE                                 0x1
#define _OPA1HWC_HWCH0_LENGTH                               0x1
#define _OPA1HWC_HWCH0_MASK                                 0x10
#define _OPA1HWC_HWCH1_POSN                                 0x5
#define _OPA1HWC_HWCH1_POSITION                             0x5
#define _OPA1HWC_HWCH1_SIZE                                 0x1
#define _OPA1HWC_HWCH1_LENGTH                               0x1
#define _OPA1HWC_HWCH1_MASK                                 0x20
#define _OPA1HWC_HWCH2_POSN                                 0x6
#define _OPA1HWC_HWCH2_POSITION                             0x6
#define _OPA1HWC_HWCH2_SIZE                                 0x1
#define _OPA1HWC_HWCH2_LENGTH                               0x1
#define _OPA1HWC_HWCH2_MASK                                 0x40
#define _OPA1HWC_OPA1HWCL_POSN                              0x0
#define _OPA1HWC_OPA1HWCL_POSITION                          0x0
#define _OPA1HWC_OPA1HWCL_SIZE                              0x3
#define _OPA1HWC_OPA1HWCL_LENGTH                            0x3
#define _OPA1HWC_OPA1HWCL_MASK                              0x7
#define _OPA1HWC_OPA1ORPOL_POSN                             0x3
#define _OPA1HWC_OPA1ORPOL_POSITION                         0x3
#define _OPA1HWC_OPA1ORPOL_SIZE                             0x1
#define _OPA1HWC_OPA1ORPOL_LENGTH                           0x1
#define _OPA1HWC_OPA1ORPOL_MASK                             0x8
#define _OPA1HWC_OPA1HWCH_POSN                              0x4
#define _OPA1HWC_OPA1HWCH_POSITION                          0x4
#define _OPA1HWC_OPA1HWCH_SIZE                              0x3
#define _OPA1HWC_OPA1HWCH_LENGTH                            0x3
#define _OPA1HWC_OPA1HWCH_MASK                              0x70
#define _OPA1HWC_OPA1OREN_POSN                              0x7
#define _OPA1HWC_OPA1OREN_POSITION                          0x7
#define _OPA1HWC_OPA1OREN_SIZE                              0x1
#define _OPA1HWC_OPA1OREN_LENGTH                            0x1
#define _OPA1HWC_OPA1OREN_MASK                              0x80
#define _OPA1HWC_OPA1HWCL0_POSN                             0x0
#define _OPA1HWC_OPA1HWCL0_POSITION                         0x0
#define _OPA1HWC_OPA1HWCL0_SIZE                             0x1
#define _OPA1HWC_OPA1HWCL0_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCL0_MASK                             0x1
#define _OPA1HWC_OPA1HWCL1_POSN                             0x1
#define _OPA1HWC_OPA1HWCL1_POSITION                         0x1
#define _OPA1HWC_OPA1HWCL1_SIZE                             0x1
#define _OPA1HWC_OPA1HWCL1_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCL1_MASK                             0x2
#define _OPA1HWC_OPA1HWCL2_POSN                             0x2
#define _OPA1HWC_OPA1HWCL2_POSITION                         0x2
#define _OPA1HWC_OPA1HWCL2_SIZE                             0x1
#define _OPA1HWC_OPA1HWCL2_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCL2_MASK                             0x4
#define _OPA1HWC_OPA1HWCH0_POSN                             0x4
#define _OPA1HWC_OPA1HWCH0_POSITION                         0x4
#define _OPA1HWC_OPA1HWCH0_SIZE                             0x1
#define _OPA1HWC_OPA1HWCH0_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCH0_MASK                             0x10
#define _OPA1HWC_OPA1HWCH1_POSN                             0x5
#define _OPA1HWC_OPA1HWCH1_POSITION                         0x5
#define _OPA1HWC_OPA1HWCH1_SIZE                             0x1
#define _OPA1HWC_OPA1HWCH1_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCH1_MASK                             0x20
#define _OPA1HWC_OPA1HWCH2_POSN                             0x6
#define _OPA1HWC_OPA1HWCH2_POSITION                         0x6
#define _OPA1HWC_OPA1HWCH2_SIZE                             0x1
#define _OPA1HWC_OPA1HWCH2_LENGTH                           0x1
#define _OPA1HWC_OPA1HWCH2_MASK                             0x40

// Register: OPA1OFFSET
#define OPA1OFFSET OPA1OFFSET
extern volatile unsigned char           OPA1OFFSET          __at(0x911);
#ifndef _LIB_BUILD
asm("OPA1OFFSET equ 0911h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFFSET                 :8;
    };
    struct {
        unsigned OFFSET0                :1;
        unsigned OFFSET1                :1;
        unsigned OFFSET2                :1;
        unsigned OFFSET3                :1;
        unsigned OFFSET4                :1;
        unsigned OFFSET5                :1;
        unsigned OFFSET6                :1;
        unsigned OFFSET7                :1;
    };
    struct {
        unsigned OPA1OFFSET             :8;
    };
    struct {
        unsigned OPA1OFFSET0            :1;
        unsigned OPA1OFFSET1            :1;
        unsigned OPA1OFFSET2            :1;
        unsigned OPA1OFFSET3            :1;
        unsigned OPA1OFFSET4            :1;
        unsigned OPA1OFFSET5            :1;
        unsigned OPA1OFFSET6            :1;
        unsigned OPA1OFFSET7            :1;
    };
} OPA1OFFSETbits_t;
