Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17176.h
extern volatile NVMCON2bits_t NVMCON2bits __at(0x1C91);
// bitfield macros
#define _NVMCON2_NVMCON2_POSN                               0x0
#define _NVMCON2_NVMCON2_POSITION                           0x0
#define _NVMCON2_NVMCON2_SIZE                               0x8
#define _NVMCON2_NVMCON2_LENGTH                             0x8
#define _NVMCON2_NVMCON2_MASK                               0xFF

// Register: SCANHADR
#define SCANHADR SCANHADR
extern volatile unsigned short          SCANHADR            __at(0x1C92);
#ifndef _LIB_BUILD
asm("SCANHADR equ 01C92h");
#endif

// Register: SCANHADRL
#define SCANHADRL SCANHADRL
extern volatile unsigned char           SCANHADRL           __at(0x1C92);
#ifndef _LIB_BUILD
asm("SCANHADRL equ 01C92h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCANHADRL              :8;
    };
    struct {
        unsigned ADRL                   :8;
    };
} SCANHADRLbits_t;
extern volatile SCANHADRLbits_t SCANHADRLbits __at(0x1C92);
// bitfield macros
#define _SCANHADRL_SCANHADRL_POSN                           0x0
#define _SCANHADRL_SCANHADRL_POSITION                       0x0
#define _SCANHADRL_SCANHADRL_SIZE                           0x8
#define _SCANHADRL_SCANHADRL_LENGTH                         0x8
#define _SCANHADRL_SCANHADRL_MASK                           0xFF
#define _SCANHADRL_ADRL_POSN                                0x0
#define _SCANHADRL_ADRL_POSITION                            0x0
#define _SCANHADRL_ADRL_SIZE                                0x8
#define _SCANHADRL_ADRL_LENGTH                              0x8
#define _SCANHADRL_ADRL_MASK                                0xFF

// Register: SCANHADRH
#define SCANHADRH SCANHADRH
extern volatile unsigned char           SCANHADRH           __at(0x1C93);
#ifndef _LIB_BUILD
asm("SCANHADRH equ 01C93h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCANHADRH              :8;
    };
    struct {
        unsigned ADRH                   :8;
    };
} SCANHADRHbits_t;
extern volatile SCANHADRHbits_t SCANHADRHbits __at(0x1C93);
// bitfield macros
#define _SCANHADRH_SCANHADRH_POSN                           0x0
#define _SCANHADRH_SCANHADRH_POSITION                       0x0
#define _SCANHADRH_SCANHADRH_SIZE                           0x8
#define _SCANHADRH_SCANHADRH_LENGTH                         0x8
#define _SCANHADRH_SCANHADRH_MASK                           0xFF
#define _SCANHADRH_ADRH_POSN                                0x0
#define _SCANHADRH_ADRH_POSITION                            0x0
#define _SCANHADRH_ADRH_SIZE                                0x8
#define _SCANHADRH_ADRH_LENGTH                              0x8
#define _SCANHADRH_ADRH_MASK                                0xFF

// Register: SCANLADR
#define SCANLADR SCANLADR
extern volatile unsigned short          SCANLADR            __at(0x1C95);
#ifndef _LIB_BUILD
asm("SCANLADR equ 01C95h");
#endif

// Register: SCANLADRL
#define SCANLADRL SCANLADRL
extern volatile unsigned char           SCANLADRL           __at(0x1C95);
#ifndef _LIB_BUILD
asm("SCANLADRL equ 01C95h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCANLADRL              :8;
    };
    struct {
        unsigned ADRL                   :8;
    };
} SCANLADRLbits_t;
extern volatile SCANLADRLbits_t SCANLADRLbits __at(0x1C95);
// bitfield macros
#define _SCANLADRL_SCANLADRL_POSN                           0x0
#define _SCANLADRL_SCANLADRL_POSITION                       0x0
#define _SCANLADRL_SCANLADRL_SIZE                           0x8
#define _SCANLADRL_SCANLADRL_LENGTH                         0x8
#define _SCANLADRL_SCANLADRL_MASK                           0xFF
#define _SCANLADRL_ADRL_POSN                                0x0
#define _SCANLADRL_ADRL_POSITION                            0x0
#define _SCANLADRL_ADRL_SIZE                                0x8
#define _SCANLADRL_ADRL_LENGTH                              0x8
#define _SCANLADRL_ADRL_MASK                                0xFF

// Register: SCANLADRH
#define SCANLADRH SCANLADRH
extern volatile unsigned char           SCANLADRH           __at(0x1C96);
#ifndef _LIB_BUILD
asm("SCANLADRH equ 01C96h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCANLADRH              :8;
    };
    struct {
        unsigned ADRH                   :8;
    };
} SCANLADRHbits_t;
extern volatile SCANLADRHbits_t SCANLADRHbits __at(0x1C96);
// bitfield macros
#define _SCANLADRH_SCANLADRH_POSN                           0x0
#define _SCANLADRH_SCANLADRH_POSITION                       0x0
#define _SCANLADRH_SCANLADRH_SIZE                           0x8
#define _SCANLADRH_SCANLADRH_LENGTH                         0x8
#define _SCANLADRH_SCANLADRH_MASK                           0xFF
#define _SCANLADRH_ADRH_POSN                                0x0
#define _SCANLADRH_ADRH_POSITION                            0x0
#define _SCANLADRH_ADRH_SIZE                                0x8
#define _SCANLADRH_ADRH_LENGTH                              0x8
#define _SCANLADRH_ADRH_MASK                                0xFF

// Register: SCANCON0
#define SCANCON0 SCANCON0
extern volatile unsigned char           SCANCON0            __at(0x1C98);
#ifndef _LIB_BUILD
asm("SCANCON0 equ 01C98h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD                     :2;
        unsigned                        :1;
        unsigned INTM                   :1;
        unsigned DABORT                 :1;
        unsigned BUSY                   :1;
        unsigned SGO                    :1;
        unsigned EN                     :1;
    };
} SCANCON0bits_t;
extern volatile SCANCON0bits_t SCANCON0bits __at(0x1C98);
// bitfield macros
#define _SCANCON0_MD_POSN                                   0x0
#define _SCANCON0_MD_POSITION                               0x0
#define _SCANCON0_MD_SIZE                                   0x2
#define _SCANCON0_MD_LENGTH                                 0x2
#define _SCANCON0_MD_MASK                                   0x3
#define _SCANCON0_INTM_POSN                                 0x3
#define _SCANCON0_INTM_POSITION                             0x3
#define _SCANCON0_INTM_SIZE                                 0x1
#define _SCANCON0_INTM_LENGTH                               0x1
#define _SCANCON0_INTM_MASK                                 0x8
#define _SCANCON0_DABORT_POSN                               0x4
#define _SCANCON0_DABORT_POSITION                           0x4
#define _SCANCON0_DABORT_SIZE                               0x1
#define _SCANCON0_DABORT_LENGTH                             0x1
#define _SCANCON0_DABORT_MASK                               0x10
#define _SCANCON0_BUSY_POSN                                 0x5
#define _SCANCON0_BUSY_POSITION                             0x5
#define _SCANCON0_BUSY_SIZE                                 0x1
#define _SCANCON0_BUSY_LENGTH                               0x1
#define _SCANCON0_BUSY_MASK                                 0x20
#define _SCANCON0_SGO_POSN                                  0x6
#define _SCANCON0_SGO_POSITION                              0x6
#define _SCANCON0_SGO_SIZE                                  0x1
#define _SCANCON0_SGO_LENGTH                                0x1
#define _SCANCON0_SGO_MASK                                  0x40
#define _SCANCON0_EN_POSN                                   0x7
#define _SCANCON0_EN_POSITION                               0x7
#define _SCANCON0_EN_SIZE                                   0x1
#define _SCANCON0_EN_LENGTH                                 0x1
#define _SCANCON0_EN_MASK                                   0x80

