Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17176.h
// Register: CRCOUTL
#define CRCOUTL CRCOUTL
extern volatile unsigned char           CRCOUTL             __at(0x1C9E);
#ifndef _LIB_BUILD
asm("CRCOUTL equ 01C9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUT                    :8;
    };
    struct {
        unsigned OUT0                   :1;
        unsigned OUT1                   :1;
        unsigned OUT2                   :1;
        unsigned OUT3                   :1;
        unsigned OUT4                   :1;
        unsigned OUT5                   :1;
        unsigned OUT6                   :1;
        unsigned OUT7                   :1;
    };
} CRCOUTLbits_t;
extern volatile CRCOUTLbits_t CRCOUTLbits __at(0x1C9E);
// bitfield macros
#define _CRCOUTL_OUT_POSN                                   0x0
#define _CRCOUTL_OUT_POSITION                               0x0
#define _CRCOUTL_OUT_SIZE                                   0x8
#define _CRCOUTL_OUT_LENGTH                                 0x8
#define _CRCOUTL_OUT_MASK                                   0xFF
#define _CRCOUTL_OUT0_POSN                                  0x0
#define _CRCOUTL_OUT0_POSITION                              0x0
#define _CRCOUTL_OUT0_SIZE                                  0x1
#define _CRCOUTL_OUT0_LENGTH                                0x1
#define _CRCOUTL_OUT0_MASK                                  0x1
#define _CRCOUTL_OUT1_POSN                                  0x1
#define _CRCOUTL_OUT1_POSITION                              0x1
#define _CRCOUTL_OUT1_SIZE                                  0x1
#define _CRCOUTL_OUT1_LENGTH                                0x1
#define _CRCOUTL_OUT1_MASK                                  0x2
#define _CRCOUTL_OUT2_POSN                                  0x2
#define _CRCOUTL_OUT2_POSITION                              0x2
#define _CRCOUTL_OUT2_SIZE                                  0x1
#define _CRCOUTL_OUT2_LENGTH                                0x1
#define _CRCOUTL_OUT2_MASK                                  0x4
#define _CRCOUTL_OUT3_POSN                                  0x3
#define _CRCOUTL_OUT3_POSITION                              0x3
#define _CRCOUTL_OUT3_SIZE                                  0x1
#define _CRCOUTL_OUT3_LENGTH                                0x1
#define _CRCOUTL_OUT3_MASK                                  0x8
#define _CRCOUTL_OUT4_POSN                                  0x4
#define _CRCOUTL_OUT4_POSITION                              0x4
#define _CRCOUTL_OUT4_SIZE                                  0x1
#define _CRCOUTL_OUT4_LENGTH                                0x1
#define _CRCOUTL_OUT4_MASK                                  0x10
#define _CRCOUTL_OUT5_POSN                                  0x5
#define _CRCOUTL_OUT5_POSITION                              0x5
#define _CRCOUTL_OUT5_SIZE                                  0x1
#define _CRCOUTL_OUT5_LENGTH                                0x1
#define _CRCOUTL_OUT5_MASK                                  0x20
#define _CRCOUTL_OUT6_POSN                                  0x6
#define _CRCOUTL_OUT6_POSITION                              0x6
#define _CRCOUTL_OUT6_SIZE                                  0x1
#define _CRCOUTL_OUT6_LENGTH                                0x1
#define _CRCOUTL_OUT6_MASK                                  0x40
#define _CRCOUTL_OUT7_POSN                                  0x7
#define _CRCOUTL_OUT7_POSITION                              0x7
#define _CRCOUTL_OUT7_SIZE                                  0x1
#define _CRCOUTL_OUT7_LENGTH                                0x1
#define _CRCOUTL_OUT7_MASK                                  0x80

// Register: CRCSHFTL
#define CRCSHFTL CRCSHFTL
extern volatile unsigned char           CRCSHFTL            __at(0x1C9E);
#ifndef _LIB_BUILD
asm("CRCSHFTL equ 01C9Eh");
#endif
// aliases
extern volatile unsigned char           CRCSHIFTL           __at(0x1C9E);
#ifndef _LIB_BUILD
asm("CRCSHIFTL equ 01C9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT0                 :1;
        unsigned SHIFT1                 :1;
        unsigned SHIFT2                 :1;
        unsigned SHIFT3                 :1;
        unsigned SHIFT4                 :1;
        unsigned SHIFT5                 :1;
        unsigned SHIFT6                 :1;
        unsigned SHIFT7                 :1;
    };
} CRCSHFTLbits_t;
extern volatile CRCSHFTLbits_t CRCSHFTLbits __at(0x1C9E);
// bitfield macros
#define _CRCSHFTL_SHIFT_POSN                                0x0
#define _CRCSHFTL_SHIFT_POSITION                            0x0
#define _CRCSHFTL_SHIFT_SIZE                                0x8
#define _CRCSHFTL_SHIFT_LENGTH                              0x8
#define _CRCSHFTL_SHIFT_MASK                                0xFF
#define _CRCSHFTL_SHIFT0_POSN                               0x0
#define _CRCSHFTL_SHIFT0_POSITION                           0x0
#define _CRCSHFTL_SHIFT0_SIZE                               0x1
#define _CRCSHFTL_SHIFT0_LENGTH                             0x1
#define _CRCSHFTL_SHIFT0_MASK                               0x1
#define _CRCSHFTL_SHIFT1_POSN                               0x1
#define _CRCSHFTL_SHIFT1_POSITION                           0x1
#define _CRCSHFTL_SHIFT1_SIZE                               0x1
#define _CRCSHFTL_SHIFT1_LENGTH                             0x1
#define _CRCSHFTL_SHIFT1_MASK                               0x2
#define _CRCSHFTL_SHIFT2_POSN                               0x2
#define _CRCSHFTL_SHIFT2_POSITION                           0x2
#define _CRCSHFTL_SHIFT2_SIZE                               0x1
#define _CRCSHFTL_SHIFT2_LENGTH                             0x1
#define _CRCSHFTL_SHIFT2_MASK                               0x4
#define _CRCSHFTL_SHIFT3_POSN                               0x3
#define _CRCSHFTL_SHIFT3_POSITION                           0x3
#define _CRCSHFTL_SHIFT3_SIZE                               0x1
#define _CRCSHFTL_SHIFT3_LENGTH                             0x1
#define _CRCSHFTL_SHIFT3_MASK                               0x8
#define _CRCSHFTL_SHIFT4_POSN                               0x4
#define _CRCSHFTL_SHIFT4_POSITION                           0x4
#define _CRCSHFTL_SHIFT4_SIZE                               0x1
#define _CRCSHFTL_SHIFT4_LENGTH                             0x1
#define _CRCSHFTL_SHIFT4_MASK                               0x10
#define _CRCSHFTL_SHIFT5_POSN                               0x5
#define _CRCSHFTL_SHIFT5_POSITION                           0x5
#define _CRCSHFTL_SHIFT5_SIZE                               0x1
#define _CRCSHFTL_SHIFT5_LENGTH                             0x1
#define _CRCSHFTL_SHIFT5_MASK                               0x20
#define _CRCSHFTL_SHIFT6_POSN                               0x6
#define _CRCSHFTL_SHIFT6_POSITION                           0x6
#define _CRCSHFTL_SHIFT6_SIZE                               0x1
#define _CRCSHFTL_SHIFT6_LENGTH                             0x1
#define _CRCSHFTL_SHIFT6_MASK                               0x40
#define _CRCSHFTL_SHIFT7_POSN                               0x7
#define _CRCSHFTL_SHIFT7_POSITION                           0x7
#define _CRCSHFTL_SHIFT7_SIZE                               0x1
#define _CRCSHFTL_SHIFT7_LENGTH                             0x1
#define _CRCSHFTL_SHIFT7_MASK                               0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned SHIFT                  :8;
    };
    struct {
        unsigned SHIFT0                 :1;
        unsigned SHIFT1                 :1;
        unsigned SHIFT2                 :1;
        unsigned SHIFT3                 :1;
        unsigned SHIFT4                 :1;
        unsigned SHIFT5                 :1;
        unsigned SHIFT6                 :1;
        unsigned SHIFT7                 :1;
    };
} CRCSHIFTLbits_t;
extern volatile CRCSHIFTLbits_t CRCSHIFTLbits __at(0x1C9E);
// bitfield macros
#define _CRCSHIFTL_SHIFT_POSN                               0x0
#define _CRCSHIFTL_SHIFT_POSITION                           0x0
#define _CRCSHIFTL_SHIFT_SIZE                               0x8
#define _CRCSHIFTL_SHIFT_LENGTH                             0x8
#define _CRCSHIFTL_SHIFT_MASK                               0xFF
#define _CRCSHIFTL_SHIFT0_POSN                              0x0
#define _CRCSHIFTL_SHIFT0_POSITION                          0x0
#define _CRCSHIFTL_SHIFT0_SIZE                              0x1
#define _CRCSHIFTL_SHIFT0_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT0_MASK                              0x1
#define _CRCSHIFTL_SHIFT1_POSN                              0x1
#define _CRCSHIFTL_SHIFT1_POSITION                          0x1
#define _CRCSHIFTL_SHIFT1_SIZE                              0x1
#define _CRCSHIFTL_SHIFT1_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT1_MASK                              0x2
#define _CRCSHIFTL_SHIFT2_POSN                              0x2
#define _CRCSHIFTL_SHIFT2_POSITION                          0x2
#define _CRCSHIFTL_SHIFT2_SIZE                              0x1
#define _CRCSHIFTL_SHIFT2_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT2_MASK                              0x4
#define _CRCSHIFTL_SHIFT3_POSN                              0x3
#define _CRCSHIFTL_SHIFT3_POSITION                          0x3
#define _CRCSHIFTL_SHIFT3_SIZE                              0x1
#define _CRCSHIFTL_SHIFT3_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT3_MASK                              0x8
#define _CRCSHIFTL_SHIFT4_POSN                              0x4
#define _CRCSHIFTL_SHIFT4_POSITION                          0x4
#define _CRCSHIFTL_SHIFT4_SIZE                              0x1
#define _CRCSHIFTL_SHIFT4_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT4_MASK                              0x10
#define _CRCSHIFTL_SHIFT5_POSN                              0x5
#define _CRCSHIFTL_SHIFT5_POSITION                          0x5
#define _CRCSHIFTL_SHIFT5_SIZE                              0x1
#define _CRCSHIFTL_SHIFT5_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT5_MASK                              0x20
#define _CRCSHIFTL_SHIFT6_POSN                              0x6
#define _CRCSHIFTL_SHIFT6_POSITION                          0x6
#define _CRCSHIFTL_SHIFT6_SIZE                              0x1
#define _CRCSHIFTL_SHIFT6_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT6_MASK                              0x40
#define _CRCSHIFTL_SHIFT7_POSN                              0x7
#define _CRCSHIFTL_SHIFT7_POSITION                          0x7
#define _CRCSHIFTL_SHIFT7_SIZE                              0x1
#define _CRCSHIFTL_SHIFT7_LENGTH                            0x1
#define _CRCSHIFTL_SHIFT7_MASK                              0x80

// Register: CRCXORL
#define CRCXORL CRCXORL
extern volatile unsigned char           CRCXORL             __at(0x1C9E);
#ifndef _LIB_BUILD
asm("CRCXORL equ 01C9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned XOR                    :8;
    };
    struct {
        unsigned XOR0                   :1;
        unsigned XOR1                   :1;
        unsigned XOR2                   :1;
        unsigned XOR3                   :1;
        unsigned XOR4                   :1;
        unsigned XOR5                   :1;
        unsigned XOR6                   :1;
        unsigned XOR7                   :1;
    };
} CRCXORLbits_t;
